Tekla Open API Reference for Tekla Structures 2025
ViewAttributes Fields
The View.ViewAttributes type exposes the following members.
Fields
Name | Description
LocationByModelOrigin
 A constant string defining that the view location is calculated by model origin.
LocationByProjectBasePoint
 A constant string defining that the view location is calculated by project base point.
Top
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace